7767517
167 179
Input            0                        0 1 0
Convolution      321                      1 1 0 321 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=0 6=864
BatchNorm        322                      1 1 321 322 0=32
Clip             323                      1 1 322 323 0=0.000000 1=6.000000
ConvolutionDepthWise 324                      1 1 323 324 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=288 7=32
BatchNorm        325                      1 1 324 325 0=32
Clip             326                      1 1 325 326 0=0.000000 1=6.000000
Convolution      327                      1 1 326 327 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=512
BatchNorm        328                      1 1 327 328 0=16
Convolution      329                      1 1 328 329 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=1536
BatchNorm        330                      1 1 329 330 0=96
Clip             331                      1 1 330 331 0=0.000000 1=6.000000
ConvolutionDepthWise 332                      1 1 331 332 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=0 6=864 7=96
BatchNorm        333                      1 1 332 333 0=96
Clip             334                      1 1 333 334 0=0.000000 1=6.000000
Convolution      335                      1 1 334 335 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=2304
BatchNorm        336                      1 1 335 336 0=24
Split            splitncnn_0              1 2 336 336_splitncnn_0 336_splitncnn_1
Convolution      337                      1 1 336_splitncnn_1 337 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=3456
BatchNorm        338                      1 1 337 338 0=144
Clip             339                      1 1 338 339 0=0.000000 1=6.000000
ConvolutionDepthWise 340                      1 1 339 340 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=1296 7=144
BatchNorm        341                      1 1 340 341 0=144
Clip             342                      1 1 341 342 0=0.000000 1=6.000000
Convolution      343                      1 1 342 343 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=3456
BatchNorm        344                      1 1 343 344 0=24
BinaryOp         345                      2 1 336_splitncnn_0 344 345 0=0
Convolution      346                      1 1 345 346 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=3456
BatchNorm        347                      1 1 346 347 0=144
Clip             348                      1 1 347 348 0=0.000000 1=6.000000
ConvolutionDepthWise 349                      1 1 348 349 0=144 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=0 6=1296 7=144
BatchNorm        350                      1 1 349 350 0=144
Clip             351                      1 1 350 351 0=0.000000 1=6.000000
Convolution      352                      1 1 351 352 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=4608
BatchNorm        353                      1 1 352 353 0=32
Split            splitncnn_1              1 2 353 353_splitncnn_0 353_splitncnn_1
Convolution      354                      1 1 353_splitncnn_1 354 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=6144
BatchNorm        355                      1 1 354 355 0=192
Clip             356                      1 1 355 356 0=0.000000 1=6.000000
ConvolutionDepthWise 357                      1 1 356 357 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=1728 7=192
BatchNorm        358                      1 1 357 358 0=192
Clip             359                      1 1 358 359 0=0.000000 1=6.000000
Convolution      360                      1 1 359 360 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=6144
BatchNorm        361                      1 1 360 361 0=32
BinaryOp         362                      2 1 353_splitncnn_0 361 362 0=0
Split            splitncnn_2              1 2 362 362_splitncnn_0 362_splitncnn_1
Convolution      363                      1 1 362_splitncnn_1 363 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=6144
BatchNorm        364                      1 1 363 364 0=192
Clip             365                      1 1 364 365 0=0.000000 1=6.000000
ConvolutionDepthWise 366                      1 1 365 366 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=1728 7=192
BatchNorm        367                      1 1 366 367 0=192
Clip             368                      1 1 367 368 0=0.000000 1=6.000000
Convolution      369                      1 1 368 369 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=6144
BatchNorm        370                      1 1 369 370 0=32
BinaryOp         371                      2 1 362_splitncnn_0 370 371 0=0
Convolution      372                      1 1 371 372 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=6144
BatchNorm        373                      1 1 372 373 0=192
Clip             374                      1 1 373 374 0=0.000000 1=6.000000
ConvolutionDepthWise 375                      1 1 374 375 0=192 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=0 6=1728 7=192
BatchNorm        376                      1 1 375 376 0=192
Clip             377                      1 1 376 377 0=0.000000 1=6.000000
Convolution      378                      1 1 377 378 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=12288
BatchNorm        379                      1 1 378 379 0=64
Split            splitncnn_3              1 2 379 379_splitncnn_0 379_splitncnn_1
Convolution      380                      1 1 379_splitncnn_1 380 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=24576
BatchNorm        381                      1 1 380 381 0=384
Clip             382                      1 1 381 382 0=0.000000 1=6.000000
ConvolutionDepthWise 383                      1 1 382 383 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=3456 7=384
BatchNorm        384                      1 1 383 384 0=384
Clip             385                      1 1 384 385 0=0.000000 1=6.000000
Convolution      386                      1 1 385 386 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=24576
BatchNorm        387                      1 1 386 387 0=64
BinaryOp         388                      2 1 379_splitncnn_0 387 388 0=0
Split            splitncnn_4              1 2 388 388_splitncnn_0 388_splitncnn_1
Convolution      389                      1 1 388_splitncnn_1 389 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=24576
BatchNorm        390                      1 1 389 390 0=384
Clip             391                      1 1 390 391 0=0.000000 1=6.000000
ConvolutionDepthWise 392                      1 1 391 392 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=3456 7=384
BatchNorm        393                      1 1 392 393 0=384
Clip             394                      1 1 393 394 0=0.000000 1=6.000000
Convolution      395                      1 1 394 395 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=24576
BatchNorm        396                      1 1 395 396 0=64
BinaryOp         397                      2 1 388_splitncnn_0 396 397 0=0
Split            splitncnn_5              1 2 397 397_splitncnn_0 397_splitncnn_1
Convolution      398                      1 1 397_splitncnn_1 398 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=24576
BatchNorm        399                      1 1 398 399 0=384
Clip             400                      1 1 399 400 0=0.000000 1=6.000000
ConvolutionDepthWise 401                      1 1 400 401 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=3456 7=384
BatchNorm        402                      1 1 401 402 0=384
Clip             403                      1 1 402 403 0=0.000000 1=6.000000
Convolution      404                      1 1 403 404 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=24576
BatchNorm        405                      1 1 404 405 0=64
BinaryOp         406                      2 1 397_splitncnn_0 405 406 0=0
Convolution      407                      1 1 406 407 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=24576
BatchNorm        408                      1 1 407 408 0=384
Clip             409                      1 1 408 409 0=0.000000 1=6.000000
ConvolutionDepthWise 410                      1 1 409 410 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=3456 7=384
BatchNorm        411                      1 1 410 411 0=384
Clip             412                      1 1 411 412 0=0.000000 1=6.000000
Convolution      413                      1 1 412 413 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=36864
BatchNorm        414                      1 1 413 414 0=96
Split            splitncnn_6              1 2 414 414_splitncnn_0 414_splitncnn_1
Convolution      415                      1 1 414_splitncnn_1 415 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=55296
BatchNorm        416                      1 1 415 416 0=576
Clip             417                      1 1 416 417 0=0.000000 1=6.000000
ConvolutionDepthWise 418                      1 1 417 418 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=5184 7=576
BatchNorm        419                      1 1 418 419 0=576
Clip             420                      1 1 419 420 0=0.000000 1=6.000000
Convolution      421                      1 1 420 421 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=55296
BatchNorm        422                      1 1 421 422 0=96
BinaryOp         423                      2 1 414_splitncnn_0 422 423 0=0
Split            splitncnn_7              1 2 423 423_splitncnn_0 423_splitncnn_1
Convolution      424                      1 1 423_splitncnn_1 424 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=55296
BatchNorm        425                      1 1 424 425 0=576
Clip             426                      1 1 425 426 0=0.000000 1=6.000000
ConvolutionDepthWise 427                      1 1 426 427 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=5184 7=576
BatchNorm        428                      1 1 427 428 0=576
Clip             429                      1 1 428 429 0=0.000000 1=6.000000
Convolution      430                      1 1 429 430 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=55296
BatchNorm        431                      1 1 430 431 0=96
BinaryOp         432                      2 1 423_splitncnn_0 431 432 0=0
Convolution      433                      1 1 432 433 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=55296
BatchNorm        434                      1 1 433 434 0=576
Clip             435                      1 1 434 435 0=0.000000 1=6.000000
ConvolutionDepthWise 436                      1 1 435 436 0=576 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=0 6=5184 7=576
BatchNorm        437                      1 1 436 437 0=576
Clip             438                      1 1 437 438 0=0.000000 1=6.000000
Convolution      439                      1 1 438 439 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=92160
BatchNorm        440                      1 1 439 440 0=160
Split            splitncnn_8              1 2 440 440_splitncnn_0 440_splitncnn_1
Convolution      441                      1 1 440_splitncnn_1 441 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=153600
BatchNorm        442                      1 1 441 442 0=960
Clip             443                      1 1 442 443 0=0.000000 1=6.000000
ConvolutionDepthWise 444                      1 1 443 444 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=8640 7=960
BatchNorm        445                      1 1 444 445 0=960
Clip             446                      1 1 445 446 0=0.000000 1=6.000000
Convolution      447                      1 1 446 447 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=153600
BatchNorm        448                      1 1 447 448 0=160
BinaryOp         449                      2 1 440_splitncnn_0 448 449 0=0
Split            splitncnn_9              1 2 449 449_splitncnn_0 449_splitncnn_1
Convolution      450                      1 1 449_splitncnn_1 450 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=153600
BatchNorm        451                      1 1 450 451 0=960
Clip             452                      1 1 451 452 0=0.000000 1=6.000000
ConvolutionDepthWise 453                      1 1 452 453 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=8640 7=960
BatchNorm        454                      1 1 453 454 0=960
Clip             455                      1 1 454 455 0=0.000000 1=6.000000
Convolution      456                      1 1 455 456 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=153600
BatchNorm        457                      1 1 456 457 0=160
BinaryOp         458                      2 1 449_splitncnn_0 457 458 0=0
Convolution      459                      1 1 458 459 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=153600
BatchNorm        460                      1 1 459 460 0=960
Clip             461                      1 1 460 461 0=0.000000 1=6.000000
ConvolutionDepthWise 462                      1 1 461 462 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=8640 7=960
BatchNorm        463                      1 1 462 463 0=960
Clip             464                      1 1 463 464 0=0.000000 1=6.000000
Convolution      465                      1 1 464 465 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=307200
BatchNorm        466                      1 1 465 466 0=320
Convolution      467                      1 1 466 467 0=1280 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=409600
BatchNorm        468                      1 1 467 468 0=1280
Clip             469                      1 1 468 469 0=0.000000 1=6.000000
Padding          470                      1 1 469 470 0=0 1=0 2=0 3=0 4=0 5=0.000000
Pooling          471                      1 1 470 471 0=1 1=7 11=7 2=7 12=7 3=0 13=0 14=0 15=0 5=1
Reshape          472                      1 1 471 472 0=1 1=-1
Split            splitncnn_10             1 3 472 472_splitncnn_0 472_splitncnn_1 472_splitncnn_2
InnerProduct     473                      1 1 472_splitncnn_2 473 0=66 1=1 2=84480
InnerProduct     474                      1 1 472_splitncnn_1 474 0=66 1=1 2=84480
InnerProduct     475                      1 1 472_splitncnn_0 475 0=66 1=1 2=84480
